results/595_driver/official_vllm_FP8c8.txt
============ Serving Benchmark Result ============
Successful requests:                     30        
Failed requests:                         0         
Maximum request concurrency:             8         
Benchmark duration (s):                  154.33    
Total input tokens:                      97924     
Total generated tokens:                  7680      
Request throughput (req/s):              0.19      
Output token throughput (tok/s):         49.76     
Peak output token throughput (tok/s):    120.00    
Peak concurrent requests:                14.00     
Total token throughput (tok/s):          684.28    
---------------Time to First Token----------------
Mean TTFT (ms):                          9400.06   
Median TTFT (ms):                        8482.12   
P99 TTFT (ms):                           20089.82  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          115.42    
Median TPOT (ms):                        121.14    
P99 TPOT (ms):                           143.29    
---------------Inter-token Latency----------------
Mean ITL (ms):                           114.97    
Median ITL (ms):                         76.07     
P99 ITL (ms):                            1914.22   
==================================================