results/595_driver/official_vllm_NVFP4c16.txt
============ Serving Benchmark Result ============
Successful requests:                     30        
Failed requests:                         0         
Maximum request concurrency:             16        
Benchmark duration (s):                  115.75    
Total input tokens:                      97924     
Total generated tokens:                  7680      
Request throughput (req/s):              0.26      
Output token throughput (tok/s):         66.35     
Peak output token throughput (tok/s):    208.00    
Peak concurrent requests:                19.00     
Total token throughput (tok/s):          912.35    
---------------Time to First Token----------------
Mean TTFT (ms):                          14582.44  
Median TTFT (ms):                        8811.18   
P99 TTFT (ms):                           37907.75  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          176.54    
Median TPOT (ms):                        198.77    
P99 TPOT (ms):                           215.95    
---------------Inter-token Latency----------------
Mean ITL (ms):                           175.85    
Median ITL (ms):                         89.87     
P99 ITL (ms):                            1931.27   
==================================================